# Joseph Kamara
## WK 13 04/12/22
### Python - Pandas series and DataFrame

In [1]:
import numpy as np
from pandas import Series, DataFrame 
import pandas as pd

In [2]:
mydataset = {
    'cars': ["GMC","Toyota","Ford"],
    'Seats': [8,9,5]
}
df1 = pd.DataFrame(mydataset)
print(df1)

     cars  Seats
0     GMC      8
1  Toyota      9
2    Ford      5

In [3]:
type(df1)

pandas.core.frame.DataFrame

In [4]:
print(pd.__version__)

1.0.5

In [5]:
#Pandas Series 
s = Series([2,5,7,-9,8,4])
s

0    2
1    5
2    7
3   -9
4    8
5    4
dtype: int64

In [6]:
print(s)

0    2
1    5
2    7
3   -9
4    8
5    4
dtype: int64

In [7]:
s.values

array([ 2,  5,  7, -9,  8,  4], dtype=int64)

In [8]:
s.index

RangeIndex(start=0, stop=6, step=1)

In [9]:
s[4]

8

In [10]:
#Create lables 
s = pd.Series([0,20,30,40], index = ["w","x","y","z"])

In [11]:
s["y"]

30

In [12]:
data = np.array(['a','b','c','d'])
s = Series(data,index = [100,200,300,400])

In [13]:
s

100    a
200    b
300    c
400    d
dtype: object

In [14]:
# list values and indies 
Summer_olyp = Series([2520,1122,937,847], index = ["USA","Russia","Germany","France"])

In [15]:
Summer_olyp["USA"in Summer_olyp]

1122

In [16]:
Summer_olyp[Summer_olyp>100]

USA        2520
Russia     1122
Germany     937
France      847
dtype: int64

In [17]:
Summer_olyp_dict = Summer_olyp.to_dict()

In [18]:
Summer_olyp_dict

{'USA': 2520, 'Russia': 1122, 'Germany': 937, 'France': 847}

In [19]:
Summer_olyp_dict ["Russia"]

1122

In [20]:
#Convert dictionary to Serices 
Summer_olyp = Series(Summer_olyp_dict)

In [21]:
Summer_olyp

USA        2520
Russia     1122
Germany     937
France      847
dtype: int64

In [22]:
countries = ["Russia","France","Spain", "Germany","USA","UK","Italy"]

In [23]:
#redefine serices 
s2 =Series( Summer_olyp_dict, index = countries)

In [24]:
s2

Russia     1122.0
France      847.0
Spain         NaN
Germany     937.0
USA        2520.0
UK            NaN
Italy         NaN
dtype: float64

In [25]:
pd.isnull(s2)

Russia     False
France     False
Spain       True
Germany    False
USA        False
UK          True
Italy       True
dtype: bool

In [26]:
pd.notnull(s2)

Russia      True
France      True
Spain      False
Germany     True
USA         True
UK         False
Italy      False
dtype: bool

In [27]:
Summer_olyp +s2

France     1694.0
Germany    1874.0
Italy         NaN
Russia     2244.0
Spain         NaN
UK            NaN
USA        5040.0
dtype: float64

In [28]:
s2.name="Summer Olympoic"

In [29]:
s2

Russia     1122.0
France      847.0
Spain         NaN
Germany     937.0
USA        2520.0
UK            NaN
Italy         NaN
Name: Summer Olympoic, dtype: float64

In [30]:
#creating a simple pandas dataframe
data = { 
"calories": [420,380,390],
"Fruits": ["Orange","Banaa", 'Graps']}

#load data into a datadrame object 
df = DataFrame(data) 
df

   calories  Fruits
0       420  Orange
1       380   Banaa
2       390   Graps

In [31]:
#locate Row using Pandas Loc Attribute 

df.loc[0]

calories       420
Fruits      Orange
Name: 0, dtype: object

In [32]:
d = df.loc[1]

In [33]:
d

calories      380
Fruits      Banaa
Name: 1, dtype: object

In [34]:
type(d)

pandas.core.series.Series

In [35]:
d = df.loc[[0,1]]

In [36]:
type(d)

pandas.core.frame.DataFrame

In [37]:
d

   calories  Fruits
0       420  Orange
1       380   Banaa

In [38]:
data_doct = {'State': ["Ohio","Ohio",'Ohio', "Navada", "Navada","Navada"],
             'year': [2000,2001,2002,2003],
                      'pop': [1.5,1.7,3.6,2.4]}

In [39]:
df.tail

<bound method NDFrame.tail of    calories  Fruits
0       420  Orange
1       380   Banaa
2       390   Graps>

In [40]:
df.head()

   calories  Fruits
0       420  Orange
1       380   Banaa
2       390   Graps

In [41]:
#Reorder the cololums
DataFrame(data_doct, columns =["year","state",'pop'])

   year state  pop
0  2000   NaN  1.5
1  2001   NaN  1.7
2  2002   NaN  3.6
3  2003   NaN  2.4

In [43]:
df2 = pd.DataFrame(data_doct, columns = ['year','state', 'pop', 'debt'],
                  index = ['one','two','there', 'four'])

In [44]:
df2

       year state  pop debt
one    2000   NaN  1.5  NaN
two    2001   NaN  1.7  NaN
there  2002   NaN  3.6  NaN
four   2003   NaN  2.4  NaN

In [45]:
df2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [47]:
del df2['debt']

In [48]:
df2

       year state  pop
one    2000   NaN  1.5
two    2001   NaN  1.7
there  2002   NaN  3.6
four   2003   NaN  2.4

In [49]:
pop_dict = {'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio':{2000:1.5,2001:1.7,2002:3.6}}
pop_dict

{'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [50]:
df3 = DataFrame(pop_dict)

In [51]:
df3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [52]:
df3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [53]:
DataFrame(df3, index = [2001,2002,2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [54]:
df3['Ohio']

2001    1.7
2002    3.6
2000    1.5
Name: Ohio, dtype: float64

In [55]:
df3['Ohio'][:2]

2001    1.7
2002    3.6
Name: Ohio, dtype: float64

In [56]:
df3['Ohio'][:-1]

2001    1.7
2002    3.6
Name: Ohio, dtype: float64